<template>
  <div class="tips">

    <div class="rule">
      <div class="winning-notes">
        <!--<i class="iconfont"></i>-->
        <span>说明</span>
        <div class="exampleDetail">{{wanfa}}</div>
      </div>
      <div class="winning-notes">
        <span>范例</span>
        <div class="exampleDetail">{{example1}}</div>
      </div>
      <div class="winning-notes">
        <span>帮助</span>
        <div class="exampleDetail">{{winningNotes1}}</div>
      </div>
    </div>
  </div>
</template>
<script>
  export default {
    computed: {
      playCode() {
        return this.$store.state.bet_selectPlay.playCode;
      },
      lotteryCode() {
        return this.$store.state.lotteryCode;
      },
      wanfa() {
        if (this.lotteryCode == 11 || this.lotteryCode == 12 || this.lotteryCode == 13 || this.lotteryCode == 14 || this.lotteryCode == 15) {
          return this.wanfaTips[11][this.playCode];
        } else if (this.lotteryCode == 31 || this.lotteryCode == 32 || this.lotteryCode == 33) {
          return this.wanfaTips[31][this.playCode];
        } else if (this.lotteryCode == 21 || this.lotteryCode == 22 || this.lotteryCode == 23) {
          return this.wanfaTips[21][this.playCode];
        } else if (this.lotteryCode == 41) {
          return this.wanfaTips[41][this.playCode];
        } else if (this.lotteryCode == 101 || this.lotteryCode == 102) {
          return this.wanfaTips[101][this.playCode];
        }
      },
      example1() {
        if (this.lotteryCode == 11 || this.lotteryCode == 12 || this.lotteryCode == 13 || this.lotteryCode == 14 || this.lotteryCode == 15) {
          return this.example[11][this.playCode];
        } else if (this.lotteryCode == 31 || this.lotteryCode == 32 || this.lotteryCode == 33) {
          return this.example[31][this.playCode];
        } else if (this.lotteryCode == 21 || this.lotteryCode == 22 || this.lotteryCode == 23) {
          return this.example[21][this.playCode];
        } else if (this.lotteryCode == 41) {
          return this.example[41][this.playCode];
        } else if (this.lotteryCode == 101 || this.lotteryCode == 102) {
          return this.example[101][this.playCode];
        }
      },
      winningNotes1() {
        if (this.lotteryCode == 11 || this.lotteryCode == 12 || this.lotteryCode == 13 || this.lotteryCode == 14 || this.lotteryCode == 15) {
          return this.winningNotes[11][this.playCode];
        } else if (this.lotteryCode == 31 || this.lotteryCode == 32 || this.lotteryCode == 33) {
          return this.winningNotes[31][this.playCode];
        } else if (this.lotteryCode == 21 || this.lotteryCode == 22 || this.lotteryCode == 23) {
          return this.winningNotes[21][this.playCode];
        } else if (this.lotteryCode == 41) {
          return this.winningNotes[41][this.playCode];
        } else if (this.lotteryCode == 101 || this.lotteryCode == 102) {
          return this.winningNotes[101][this.playCode];
        }
      },
    },
    methods: {},
    data() {
      return {
        example: false,
        //玩法提示部分
        //玩法提示部分
        wanfaTips: {
          //11选5
          "11": {
            "11": "从第一位、第二位、第三位中至少各选择1个号码。",
            "12": "从01-11中任意选择3个或3个以上号码。",
            "9": "从第一位、第二位中至少各选择1个号码。",
            "10": "从01-11中任意选择2个或2个以上号码。",
            "23": "从01-11中任意选择1个或1个以上号码。",
            "24": "从任意位置上任意选择1个或1个以上号码。",
            "22": "从01-11中任意选择1个或1个以上号码。",
            "1": "从01-11中任意选择2个或2个以上号码。",
            "2": "从01-11中任意选择3个或3个以上号码。",
            "3": "从01-11中任意选择4个或4个以上号码。",
            "4": "从01-11中任意选择5个或5个以上号码。",
            "5": "从01-11中任意选择6个或6个以上号码。",
            "6": "从01-11中任意选择7个或7个以上号码。",
            "7": "从01-11中任意选择8个或8个以上号码。",
          },
          //时时彩
          "21": {
            "1111": "在万千百十个位任意位置上任意选择1个或1个以上号码。",
            "1211": "从万、千、百、十、个位各选一个号码组成一注。",
            "1213": "从个、十、百、千、万位各选一个号码组成五注。",
            "1214": "从0-9中选择5个号码组成一注。",
            "1215": "从“二重号”选择一个号码，“单号”中选择三个号码组成一注。",
            "1216": "从“二重号”选择两个号码，“单号”中选择一个号码组成一注。",
            "1217": "从“三重号”选择一个号码，“单号”中选择两个号码组成一注。",
            "1218": "从“三重号”选择一个号码，“二重号”中选择一个号码组成一注。",
            "1219": "从“四重号”选择一个号码，“单号”中选择一个号码组成一注。",
            "2311": "从千位、百位、十位、个位中选择一个4位数号码组成一注",
            "2312": "从千位，百位，十位，个位任选择1个或1个以上号码。",
            "2313": "从0-9中选择4个号码组成一注。",
            "2314": "从“二重号”选择一个号码，“单号”中选择两个号码组成一注。",
            "2315": "从“二重号”选择两个号码组成一注。",
            "2316": "从“三重号”选择一个号码，“单号”中选择一个号码组成一注。",
            "2411": "从万位、千位、百位、十位中选择一个4位数号码组成一注。",
            "2412": "从万、千、百、十位四个位置上各任选1个号码组成四注。",
            "2413": "从0-9中选择4个号码组成一注。",
            "2414": "从“二重号”选择一个号码，“单号”中选择两个号码组成一注。",
            "2415": "从“二重号”选择两个号码组成一注。",
            "2416": "从“三重号”选择一个号码，“单号”中选择一个号码组成一注。",
            "1311": "从百、十、个位各选一个号码组成一注。",
            "1314": "从0-27中任意选择1个或1个以上号码",
            "1312": "从0-9中任意选择2个或2个以上号码。",
            "1313": "从0-9中任意选择3个或3个以上号码。",
            "2511": "从千、百、十位各选一个号码组成一注。",
            "2512": "从0-27中任意选择1个或1个以上号码",
            "2513": "从0-9中任意选择2个或2个以上号码。",
            "2514": "从0-9中任意选择3个或3个以上号码。",
            "2611": "从万、千、百位各选一个号码组成一注。",
            "2612": "从0-27中任意选择1个或1个以上号码",
            "2613": "从0-9中任意选择2个或2个以上号码。",
            "2614": "从0-9中任意选择3个或3个以上号码。",
            "1411": "从十、个位各选一个号码组成一注。",
            "1413": "从0-18中任意选择1个或1个以上的和值号码。",
            "1414": "从十位、个位中的“大、小、单、双”中至少各选一个组成一注。",
            "1412": "从0-9中任意选择2个或2个以上号码。",
            "1415": "从万、千位各选一个号码组成一注。",
            "1416": "从0-18中任意选择1个或1个以上的和值号码。",
            "1417": "从万位、千位中的“大 小 单 双”中至少各选一个组成一注。",
            "1418": "从0-9中任意选择2个或2个以上号码。",
            "1613": "从0-9中任意选择1个以上号码。",
            "1622": "从0-9中任意选择1个以上号码。",
            "1611": "从0-9中任意选择1个以上号码。",
            "1614": "从0-9中任意选择2个以上号码。",
            "1623": "从0-9中任意选择2个以上号码。",
            "1612": "从0-9中任意选择2个以上号码。",
            "1711": "从万位、千位、百位、十位、个位中至少两位上各选1个号码组成一注。",
            "1713": "从万位、千位、百位、十位、个位中至少选择两个位置,号码区至少选择两个号码构成一注。",
            "1811": "万、千、百、十、个任意3位，开奖号分别对应且顺序一致即中奖。",
            "1813": "从0-9中任意选择2个或2个以上号码和任意三个位置",
            "1814": "从0-9中任意选择3个或3个以上号码和任意三个位置",
            "1911": "万、千、百、十、个任意4位，开奖号分别对应且顺序一致即中奖",
            "2011": "至少选择一个号码组成一注。",
            "2022": "至少选择一个号码组成一注。",
            "2023": "至少选择一个号码组成一注。",
            "2024": "至少选择一个号码组成一注。",
            "2025": "至少选择一个号码组成一注。",
            "2111": "从0-9中任意选择1个以上号码。",
            "2112": "从0-9中任意选择1个以上的二重号码。",
            "2113": "从0-9中任意选择1个以上的三重号码。",
            "2114": "从0-9中任意选择1个以上的四重号码。",
            "2211": "从万位、千位上选择一个形态组成一注。",
            "2212": "从万位、百位上选择一个形态组成一注。",
            "2213": "从万位、十位上选择一个形态组成一注。",
            "2214": "从万位、个位上选择一个形态组成一注。",
            "2215": "从千位、百位上选择一个形态组成一注。",
            "2216": "从千位、十位上选择一个形态组成一注。",
            "2217": "从千位、个位上选择一个形态组成一注。",
            "2218": "从百位、十位上选择一个形态组成一注。",
            "2219": "从百位、个位上选择一个形态组成一注。",
            "2220": "从十位、个位上选择一个形态组成一注。",
          },
          //PK拾
          "41": {
            "1": "从第一名中至少选择1个号码组成一注。",
            "2": "从第一名、第二名中至少选择1个号码组成一注。",
            "3": "从第一位、第二位、第三位中至少各选择1个号码。",
            "5": "从第一名到第五名任意位置上选择1个或1个以上号码。",
            "6": "从第六名到第十名任意位置上选择1个或1个以上号码。",
            "7": "选择第一名车号大小为一注。",
            "8": "选择第二名车号大小为一注。",
            "9": "选择第三名车号大小为一注。",
            "10": "选择第一名车号单双为一注。",
            "11": "选择第二名车号单双为一注。",
            "12": "选择第三名车号单双为一注。",
          },
          //排列三
          "101": {
            "1111": "从百位、十位、个位各选一个号码组成一注。",
            "1112": "从0-27中任意选择1个或1个以上号码。",
            "1113": "从0-9中任意选择2个或2个以上号码。",
            "1114": "从0-9中任意选择3个或3个以上号码。",
            "1214": "从0-9中任意选择2个或2个以上号码。",
            "1212": "从十位、个位中至少各选1个号码组成一注。",
            "1215": "从0-18中任意选择1个或1个以上的和值号码。",
            "1211": "从百位、十位中至少各选1个号码组成一注。",
            "1216": "从0-18中任意选择1个或1个以上的和值号码。",
            "1213": "从0-9中任意选择2个或2个以上号码。",
            "1311": "在百位、十位、个位任意位置上任意选择1个或1个以上号码。",
            "1411": "从0-9中任意选择1个以上号码。"

          },
          //快三
          "31": {
            "1": "从3-18中任意选择1个或1个以上号码。",
            "3": "对所有相同的三个号码：（111 222 333 444 555 666）中任意选择一组号码进行投注。",
            "2": "对所有相同的三个号码：111 222 333 444 555 666进行投注。",
            "4": "对三个各不相同的号码进行投注。",
            "5": "对所有三个相连的号码（仅限：123、234、345、456）进行投注。",
            "6": "对三个号码中两个指定的相同号码进行投注。。",
            "7": "对三个号码中两个指定的相同号码与一个指定的不同号码进行投注。",
            "8": "对三个号码中两个指定的不同号码进行投注。",
            "9": "从1~6中，选取2个及以上的号码进行投注，每注需至少包括1个胆码及1个拖码。",
          }
        },
        //范例
        example: {
          "11": {
            "11": "投注方案：01 02 03 开奖号码：01 02 03** （前三顺序一致），即中前三直选。",
            "12": "投注方案：01 02 03 开奖号码：03 01 02** （前三顺序不限），即中前三组选",
            "9": "投注方案：06 08 开奖号码：06 08*** （前二顺序一致），即中前二直选。",
            "10": "投注方案：06 08 开奖号码：08 06*** （前二顺序不限），即中前二组选。",
            "23": "投注方案：08 开奖号码：*08*** 08**** 顺序不限，即中前三位。",
            "24": "投注方案：第一位 08 开奖号码：08**** 即中定位胆。",
            "22": "投注方案：08 开奖号码：08 05 07 03 06 即中任选一中一。",
            "1": "投注方案：06 08 开奖号码：06 05 07 08 01即中任选二中二",
            "2": "投注方案：06 07 08 开奖号码：06 05 07 03 08 即中任选三中三。",
            "3": "投注方案：05 06 07 08 开奖号码：08 05 07 06 01 即中任选四中四。",
            "4": "投注方案：01 02 03 04 05  开奖号码：02 05 04 03 01 即中任选五中五。",
            "5": "投注方案：01 02 03 04 05 06  开奖号码：02 05 04 03 01 即中任选六中五。",
            "6": "投注方案：01 02 03 04 05 06 07  开奖号码：02 05 07 03 01 即中任选七中五。",
            "7": "投注方案：01 02 03 04 05 06 07 08开奖号码：02 05 07 03 01 即中任选八中五。",
          },
          //时时彩
          "21": {
            "1211": "投注方案：23456；开奖号码：23456，即中五星直选。",
            "1213": "五星组合示例，如购买：4+5+6+7+8，该票共10元，由以下5注：45678(五星)、5678(四星)、678(三星)、78(二星)、8(一星)构成。开奖号码：45678，即可中五星、四星、三星、二星、一星奖各1注。",
            "1214": "投注方案：02568，开奖号码的五个数字只要包含0、2、5、6、8，即可中五星组选120一等奖。",
            "1215": "投注方案：二重号：8，单号：0、2、5，只要开奖的5个数字包括 0、2、5、8、8，即可中五星组选60一等奖。",
            "1216": "投注方案：二重号：2、8，单号：0，只要开奖的5个数字包括 0、2、2、8、8，即可中五星组选30一等奖。",
            "1217": "投注方案：三重号：8，单号：0、2，只要开奖的5个数字包括 0、2、8、8、8，即可中五星组选20一等奖。",
            "1218": "投注方案：三重号：8，二重号：2，只要开奖的5个数字包括 2、2、8、8、8，即可中五星组选10一等奖。",
            "1219": "投注方案：四重号：8，单号：2，只要开奖的5个数字包括 2、8、8、8、8，即可中五星组选5一等奖。",
            "2311": "投注方案：* 6 7 8 9 开奖号码：* 6 7 8 9 即中四星直选。",
            "2312": "投注方案：5 6 7 8，有以下4注：5678（四星）、678（三星）、78（二星）、8（一星）构成。开奖号码：5678，即中四星、三星、二星、一星各1注。",
            "2313": "投注方案：0 5 6 8 开奖号码：* 8 5 6 0（顺序不限）即中后四组选24。",
            "2314": "投注方案：二重号：8，单号：0、6，只要开奖的四个数字包括 0、6、8、8，即可中四星组选12。",
            "2315": "投注方案：二重号：6、8，只要开奖的四个数字从小到大排列为 6、6、8、8，即可中四星组选6。",
            "2316": "投注方案：三重号：8，单号：2，只要开奖的四个数字从小到大排列为 2、8、8、8，即可中四星组选4。",
            "2411": "投注方案：3456；开奖号码：3456*，即中四星直选。",
            "2412": "投注方案：四星组合示例，如购买5+6+7+8，有以下4注：5678（四星）、678（三星）、78（二星）、8（一星）构成。开奖号码：5678，即中四星、三星、二星、一星各1注。",
            "2413": "投注方案：0568，开奖号码的四个数字只要包含0、5、6、8，即可中四星组选24一等奖。",
            "2414": "投注方案：二重号：8，单号：0、6，只要开奖的四个数字包括 0、6、8、8，即可中四星组选12一等奖。",
            "2415": "投注方案：二重号：6、8，只要开奖的四个数字从小到大排列为 6、6、8、8，即可中四星组选6。",
            "2416": "投注方案：二重号：6、8，只要开奖的四个数字从小到大排列为 6、6、8、8，即可中四星组选6。",
            "1311": "投注方案：345；开奖号码：345；即中后三直选。",
            "1314": "投注方案：和值1；开奖号码后三位：001,010,100,即中后三直选和值。",
            "1312": "投注方案58，开奖号码1个5,2个8；或者2个5，一个8（顺序不限），即中组选三。",
            "1313": "投注方案：2,5,8；开奖号码后三位：1个2、1个5、1个8 (顺序不限)，即中后三组选六。",
            "2511": "投注方案：456； 开奖号码：456，即中中三直选。",
            "2512": "投注方案：和值1；开奖号码中间三位：01001,00010,00100,即中中三直选和值。",
            "2513": "投注方案：5,8,8；开奖号码中间三位：1个5，2个8 (顺序不限)，即中中三组选三。",
            "2514": "投注方案：2,5,8；开奖号码中间三位：1个2、1个5、1个8 (顺序不限)，即中中三组选六。",
            "2611": "投注方案：345； 开奖号码：345，即中前三直选。",
            "2612": "投注方案：和值1；开奖号码前三位：001,010,100,即中前三直选和值。",
            "2613": "投注方案：5,8,8；开奖号码前三位：1个5，2个8 (顺序不限)，即中前三组选三。",
            "2614": "投注方案：2,5,8；开奖号码前三位：1个2、1个5、1个8 (顺序不限)，即中前三组选六。",
            "1411": "投注方案：58；开奖号码后二位：58，即中后二直选一等奖。",
            "1412": "投注方案：5,8；开奖号码后二位：1个5，1个8 (顺序不限)，即中后二组选。",
            "1413": "投注方案：和值1；开奖号码后二位：01,10，即中后二直选和值。",
            "1414": "投注方案：大单；开奖号码十位与个位：大单，即中后二大小单双。",
            "1415": "投注方案：58；开奖号码前二位：58，即中前二直选。",
            "1416": "投注方案：和值1；开奖号码前二位：01,10，即中前二直选和值。",
            "1417": "投注方案：小双；开奖号码万位2 千位8（万位小千位双），即中前二大小单双。",
            "1418": "投注方案：5,8；开奖号码前二位：1个5，1个8 (顺序不限)，即中前二组选。",
            "1111": "投注方案：万位1；开奖号码万位：1，即中定位胆万位。",
            "1611": "投注方案：1；开奖号码前三位：至少出现1个1，即中前三一码不定位。",
            "1613": "投注方案：1；开奖号码后三位：至少出现1个1，即中后三一码不定位。",
            "1622": "投注方案：1；开奖号码中间三位：至少出现1个1，即中中三一码不定位。",
            "1612": "投注方案：1,2；开奖号码前三位：至少出现1和2各1个，即中前三二码不定位。",
            "1614": "投注方案：1,2；开奖号码后三位：至少出现1和2各1个，即中后三二码不定位。",
            "1623": "投注方案：1,2；开奖号码中间三位：至少出现1和2各1个，即中中三二码不定位。",
            "1711": "投注方案：万位1，千位2 开奖号码：12345，即为中奖。",
            "1713": "投注方案：位置选择万、千位，选择号码56 开奖号码：56823或者65789，即为中奖。",
            "1811": "万位买0，千位买1，百位买2，十位买3，开奖01234，则中奖。",
            "1813": "位置选择万、千、百，号码选择01；开奖号码为110**、则中奖",
            "1814": "位置选择万、千、百，号码选择012；开奖号码为012**、则中奖",
            "1911": "万位买0，千位买1，百位买2，十位买3，个位买4，开奖号码01234，则中奖。",
            "2011": "投注方案：选择5, 等于开奖号前三位2,5,7的最大数7与最小数字2的差值，即为中奖。",
            "2022": "投注方案：选择5, 等于开奖号中三位2,5,7的最大数7与最小数字2的差值，即为中奖。",
            "2023": "投注方案：选择5, 等于开奖号后三位2,5,7的最大数7与最小数字2的差值，即为中奖。",
            "2024": "投注方案：选择5, 等于开奖号前二位2,7的最大数7与最小数字2的差值，即为中奖。",
            "2025": "投注方案：选择5, 等于开奖号后二位2,7的最大数7与最小数字2的差值，即为中奖。",
            "2111": "投注方案：8；开奖号码：至少出现1个8，即中一帆风顺。",
            "2112": "投注方案：8；开奖号码：至少出现2个8，即中好事成双。",
            "2113": "投注方案：8；开奖号码：至少出现3个8，即中三星报喜。",
            "2114": "投注方案：8；开奖号码：至少出现4个8，即中四季发财。",
            "2211": "投注方案：龙；开奖号码万位8千位6,即中奖。",
            "2212": "投注方案：龙；开奖号码万位8百位6,即中奖。",
            "2213": "投注方案：龙；开奖号码万位8十位6,即中奖。",
            "2214": "投注方案：龙；开奖号码万位8个位6,即中奖。",
            "2215": "投注方案：龙；开奖号码千位8百位6,即中奖。",
            "2216": "投注方案：龙；开奖号码千位8十位6,即中奖。",
            "2217": "投注方案：龙；开奖号码千位8个位6,即中奖。",
            "2218": "投注方案：龙；开奖号码百位8十位6,即中奖。",
            "2219": "投注方案：龙；开奖号码百位8个位6,即中奖。",
            "2220": "投注方案：龙；开奖号码十位8个位6,即中奖。"
          },
          //PK拾
          "41": {
            "1": "投注方案：01 开奖号码：01 02 03 04 05 06 07 08 09 10 即可中前一直选。",
            "2": "投注方案：第一名01，第二名02 开奖号码：01 02 03 04 05 06 07 08 09 10即可中前二直选。",
            "3": "投注方案：第一名01 第二名02 第三名03，开奖号码：01 02 03 04 05 06 07 08 09 10即可中前三直选。",
            "5": "投注方案：第一名01，开奖号码：01 02 03 04 05 06 07 08 09 10即中定位胆。",
            "6": "投注方案：第六名06，开奖号码：01 02 03 04 05 06 07 08 09 10即中定位胆。",
            "7": "如第一名购买号码为大，开奖号码第一位为大（6,7,8,9,10）即为中奖。（1,2,3,4,5,）即为不中奖。",
            "8": "如第二名购买号码为大，开奖号码第二位为大（6,7,8,9,10）即为中奖。（1,2,3,4,5,）即为不中奖。",
            "9": "如第三名购买号码为大，开奖号码第三位为大（6,7,8,9,10）即为中奖。（1,2,3,4,5,）即为不中奖。",
            "10": "如第一名购买号码为单，开奖号码第一位为单（1,3,5,7,9）即为中奖。（2,4,6,8,10,）即为不中奖。",
            "11": "如第二名购买号码为单，开奖号码第二位为单（1,3,5,7,9）即为中奖。（2,4,6,8,10,）即为不中奖。",
            "12": "如第二名购买号码为单，开奖号码第二位为单（1,3,5,7,9）即为中奖。（2,4,6,8,10,）即为不中奖。",
          },
          //排列三
          "101": {
            "1111": "投注方案：789 开奖号码：789 即中三码直选。",
            "1112": "投注方案：1 开奖号码：001 010 100 即中三码直选和值。",
            "1113": "投注方案：58 开奖号码：585 858等（顺序不限）即中组选三。",
            "1114": "投注方案：2 5 8 开奖号码：852或582（顺序不限），即中组选六",
            "1212": "投注方案：5 8 开奖号码：后二位5 8，即中后二直选。",
            "1215": "和值1开奖号码：后二位01,10，即中后二直选和值。",
            "1214": "投注方案：5 8 开奖号码：后二位5 8或8 5（顺序不限，不含对子），即中后二组选。",
            "1211": "投注方案：5 8 开奖号码：前二位5 8即中前二直选。",
            "1216": "和值1 开奖号码：前二位01，10，即中前二直选和值。",
            "1213": "投注方案：5 8 开奖号码：前二位5 8或8 5（顺序不限，不含对子），即中前二组选。",
            "1311": "投注方案：1 开奖号码：百位1，即中定位胆百位。",
            "1411": "投注方案：1 开奖号码：至少出现1个1，即中一码不定位。"

          },
          "31": {
            "1": "投注方案：6 开奖号码：123，即中和值。",
            "3": "投注方案：666 开奖号码为：666 即中三同号单选。",
            "2": "投注方案：三同号通选 开奖号码：111 222 333 444 555 666即中三同号通选。",
            "4": "投注方案：5 6 8 开奖号码：685或586(顺序不限)即中三不同号。",
            "5": "投注方案：三连号通选 开奖号码：123 234 345 456即中三连号通选。",
            "6": "投注方案：66 开奖号码：661 662 366 466 566 即中二同号复选。",
            "7": "投注方案：同号66 不同号8 开奖号码：668 866中任意一个，即中二同号单选。",
            "8": "投注方案：6 8 开奖号码：689 668 ，即中二不同号。",
            "9": "投注方案：胆码1 拖码2  开奖号码：123 321 即中二不同号胆拖。",
          }
        },
        //中奖说明
        winningNotes: {
          "11": {
            "11": "从01-11中各选择3个不重复的号码组成一注，所选号码与当期5个开奖号码中的前3个号码相同，且顺序一致，即为中奖。",
            "12": "从01-11中各选择3个不重复号码组成一注，所选号码与当期顺5个开奖号码中的前3个号码相同，且顺序不限，即为中奖。",
            "9": "从01-11中选择2个不重复号码组成一注，所选号码与当期5个号码中的前2个号码相同，且顺序一致，即为中奖。",
            "10": "从01-11个号码中选择2个或多个号码，所选号码与当期5个开奖号码中的前2个号码相同，顺序不限，即为中奖。",
            "23": "从11个号码中选择1个或多个号码，每注由1个号码组成，只要当期开奖号码中的第一位、第二位、第三位包含所选号码，顺序不限，即为中奖。",
            "24": "从第一位至第五位中任意1个位置或多个位置上选择1个或1个以上号码，投注号码与相同位置上的开奖号码对位一致，即为中奖。",
            "22": "从11个号码中选择1个或多个号码，每注由1个号码组成，只要当期的5个开奖号码中包含所选号码，即为中奖。",
            "1": "从01-11共11个号码中选择两个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖",
            "2": "从11个号码中选择3个或多个号码，每注由3个号码组成，只要当期的5个开奖号码中包含所选号码，即为中奖。",
            "3": "从11个号码中选择4个或多个号码，每注由4个号码组成，只要当期的5个开奖号码中包含所选号码，即为中奖。",
            "4": "从11个号码中选择5个或多个号码，每注由5个号码组成，只要当期的5个开奖号码中包含所选号码，即为中奖。",
            "5": "从11个号码中选择6个或多个号码，每注由6个号码组成，只要当期的5个开奖号码中包含所选号码，即为中奖。",
            "6": "从11个号码中选择7个或多个号码，每注由7个号码组成，只要当期的5个开奖号码中包含所选号码，即为中奖。",
            "7": "从11个号码中选择8个或多个号码，每注由8个号码组成，只要当期的5个开奖号码中包含所选号码，即为中奖。"
          },
          //时时彩
          "21": {
            "1211": "从万位、千位、百位、十位、个位中选择一个5位数号码组成一注，所选号码与开奖号码全部相同，且顺序一致，即为中奖。",
            "1213": "从万位、千位、百位、十位、个位中至少各选一个号码组成1-5星的组合，共五注，所选号码的个位与开奖号码相同，则中1个5等奖；所选号码的个位、十位与开奖号码相同，则中1个5等奖以及1个4等奖，依此类推，最高可中5个奖。",
            "1214": "从0-9中任意选择5个号码组成一注，所选号码与开奖号码的万位、千位、百位、十位、个位相同，顺序不限，即为中奖。",
            "1215": "选择1个二重号码和3个单号号码组成一注，所选的单号号码与开奖号码相同，且所选二重号码在开奖号码中出现了2次，即为中奖。",
            "1216": "选择2个二重号和1个单号号码组成一注，所选的单号号码与开奖号码相同，且所选的2个二重号码分别在开奖号码中出现了2次，即为中奖。",
            "1217": "选择1个三重号码和2个单号号码组成一注，所选的单号号码与开奖号码相同，且所选三重号码在开奖号码中出现了3次，即为中奖。",
            "1218": "选择1个三重号码和1个二重号码，所选三重号码在开奖号码中出现3次，并且所选二重号码在开奖号码中出现了2次，即为中奖。",
            "1219": "选择1个四重号码和1个单号号码组成一注，所选的单号号码与开奖号码相同，且所选四重号码在开奖号码中出现了4次，即为中奖。",
            "2311": "从千位、百位、十位、个位中至少各选1个号码组成一注，所选号码与开奖后4位相同，且顺序一致，即为中奖。",
            "2312": "从千位、百位、十位、个位中至少各选一个号码组成1-4星的组合共4注，所选号码的个位与开奖号码全部相同，则中1个四等奖；所选号码的十位、个位与开奖号码全部相同，则中一个四等奖以及一个三等奖，依此类推，最高可中4个奖。",
            "2313": "从0-9中任意选择4个号码组成一注，后四位开奖号码包含所选号码，且顺序不限，即为中奖。",
            "2314": "选择1个二重号码和2个单号号码组成一注，所选单号号码与开奖号码相同，且所选二重号码在开奖号码中出现2次，即为中奖。",
            "2315": "选择2个二重号码组成一注，所选的2个二重号码在开奖号码中分别出现了2次，即为中奖。",
            "2316": "选择1个三重号码和1个单号号码组成一注，所选单号号码与开奖号码相同，且所选三重号码在开奖号码中出现了3次，即为中奖。",
            "2411": "从万位、千位、百位、十位中选择一个4位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。",
            "2412": "从万位、千位、百位、十位、中至少各选一个号码组成1-4星的组合共4注，所选号码的十位与开奖号码全部相同，则中1个四等奖；所选号码的百位、十位与开奖号码全部相同，则中一个四等奖以及一个三等奖，依此类推，最高可中4个奖。",
            "2413": "从0-9中任意选择4个号码组成一注，所选号码与开奖号码的万位、千位、百位、十位相同，且顺序不限，即为中奖。",
            "2414": "选择1个二重号码和2个单号号码组成一注，所选单号号码与开奖号码相同，且所选二重号码在开奖号码中出现了2次，即为中奖。",
            "2415": "选择2个二重号码组成一注，所选的2个二重号码在开奖号码中分别出现了2次，即为中奖。",
            "2416": "选择1个三重号码和1个单号号码组成一注，所选单号号码与开奖号码相同，且所选三重号码在开奖号码中出现了3次，即为中奖。",
            "1311": "从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码后3位相同，且顺序一致，即为中奖。",
            "1314": "所选数值等于开奖号码的百位、十位、个位三个数字相加之和，即为中奖。",
            "1312": "从0-9中选择2个数字组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限，即为中奖。",
            "1313": "从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。",
            "2511": "从千位、百位、十位中选择一个3位数号码组成一注，所选号码与开奖号码的中间3位相同，且顺序一致，即为中奖。",
            "2512": "所选数值等于开奖号码的千位、百位、十位三个数字相加之和，即为中奖。",
            "2513": "从0-9中选择2个数字组成两注，所选号码与开奖号码的千位、百位、十位相同，且顺序不限，即为中奖。",
            "2514": "从0-9中任意选择3个号码组成一注，所选号码与开奖号码的千位、百位、十位相同，顺序不限，即为中奖。",
            "2611": "从万位、千位、百位中选择一个3位数号码组成一注，所选号码与开奖号码的前3位相同，且顺序一致，即为中奖。",
            "2612": "所选数值等于开奖号码的万位、千位、百位三个数字相加之和，即为中奖。",
            "2613": "从0至9中任选2个不同号码组成两注，开奖号码的万位、千位、百位包含所选号码，且其中必须有一个号码重复，顺序不限，即为中奖。",
            "2614": "从0至9中任选3个不同号码组成一注，开奖号码的万位、千位、百位包含所选号码，不可有号码重复，顺序不限，即为中奖。",
            "1411": "从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的十位、个位相同，且顺序一致，即为中奖。",
            "1412": "从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限，即中奖。",
            "1414": "对十位和个位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。",
            "1413": "所选数值等于开奖号码的十位、个位二个数字相加之和，即为中奖。",
            "1417": "对万位、千位的【大 56789】【小 01234】【单 13579】【双 02468】号码形态进行购买，所选号码（形态）与开奖号码（形态）相同，顺序一致，即为中奖。",
            "1415": "从万位、千位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。",
            "1416": "所选数值等于开奖号码的万位、千位二个数字相加之和，即为中奖。",
            "1418": "从0-9中选2个号码组成一注，所选号码与开奖号码的万位、千位相同，顺序不限，即中奖。",
            "1111": "从万位、千位、百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。",
            "1611": "从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位中包含所选号码，即为中奖。",
            "1613": "从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的千位、百位、十位中包含所选号码，即为中奖。",
            "1622": "从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的百位、十位、个位中包含所选号码，即为中奖。",
            "1612": "从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位、千位、百位中同时包含所选的2个号码，即为中奖。",
            "1614": "从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的百位、十位、个位中同时包含所选的2个号码，即为中奖。",
            "1623": "从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的千位、百位、十位中同时包含所选的2个号码，即为中奖。",
            "1711": "从万，千，百，十，个位中至少选择两个位置，至少各选一个号码组成一注，所选号码与开奖号码的指定位置上的号码相同，顺序不限，即为中奖。",
            "1713": "从万、千、百、十、个位中至少选择两个位置，至少选个两个号码组成一注，所选号码与开奖号码指定位置上的号码相同，且顺序不限，即为中奖。",
            "1811": "从万、千、百、十、个中至少3个位置各选一个或多个号码，将各个位置的号码进行组合，所选位置号码与开奖位置号码相同则中奖。",
            "1813": "从0-9中任意选择2个或2个以上号码和万、千、百、十、个任意的三个位置，如果组合的号码与开奖号码对应则中奖",
            "1814": "从0-9中任意选择3个或3个以上号码和万、千、百、十、个任意的三个位置，如果组合的号码与开奖号码对应则中奖",
            "1911": "从万、千、百、十、个中至少4个位置各选一个或多个号码，将各个位置的号码进行组合，所选位置号码与开奖位置号码相同则中奖。",
            "2011": "玩法：从0-9任选一个号码组成一注，所选号码与开奖号前三位的最大最小数字的差值相等，即中奖。",
            "2022": "玩法：从0-9任选一个号码组成一注，所选号码与开奖号中三位的最大最小数字的差值相等，即中奖。",
            "2023": "玩法：从0-9任选一个号码组成一注，所选号码与开奖号后三位的最大最小数字的差值相等，即中奖。",
            "2024": "玩法：从0-9任选一个号码组成一注，所选号码与开奖号前二位的最大最小数字的差值相等，即中奖。",
            "2025": "玩法：从0-9任选一个号码组成一注，所选号码与开奖号后二位的最大最小数字的差值相等，即中奖。",
            "2111": "从0-9中任意选择1个号码组成一注，只要开奖号码的万位、千位、百位、十位、个位中包含所选号码，即为中奖。",
            "2112": "从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现2次，即为中奖。",
            "2113": "从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现3次，即为中奖。",
            "2114": "从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现4次，即为中奖。",
            "2211": "根据万位、千位号码数值比大小，万位号码大于千位号码为龙，万位号码小于千位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2212": "根据万位、百位号码数值比大小，万位号码大于百位号码为龙，万位号码小于百位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2213": "根据万位、十位号码数值比大小，万位号码大于十位号码为龙，万位号码小于十位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2214": "根据万位、个位号码数值比大小，万位号码大于个位号码为龙，万位号码小于个位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2215": "根据千位、百位号码数值比大小，千位号码大于百位号码为龙，千位号码小于百位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2216": "根据千位、十位号码数值比大小，千位号码大于十位号码为龙，千位号码小于十位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2217": "根据千位、个位号码数值比大小，千位号码大于个位号码为龙，千位号码小于个位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2218": "根据百位、十位号码数值比大小，百位号码大于十位号码为龙，百位号码小于十位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2219": "根据百位、个位号码数值比大小，百位号码大于个位号码为龙，百位号码小于个位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。",
            "2220": "根据十位、个位号码数值比大小，十位号码大于个位号码为龙，十位号码小于个位号码为虎，号码相同则为和。所选形态与开奖号码形态一致，即为中奖。"
          },
          //PK拾
          "41": {
            "1": "从01-10中至少选择1个号码组成一注，所选号码与开奖号码中第一位相同即中奖。",
            "2": "从第一名、第二名中至少各选一个号码组成一注，开奖号码中第一、第二位与选号按位相同，即为中奖。",
            "3": "从第一名、第二名、第三名中至少各选择一个号码组成一注，开奖号码中第一、第二、第三位与选号按位相同，即为中奖",
            "5": "从第一名到第五名任意位置上选择1个或1个以上号码，每注由1个号码组成，所选号码与相同位置上的开奖号码一致，即为中奖。",
            "6": "从第六名到第十名任意位置上选择1个或1个以上号码，每注由1个号码组成，所选号码与相同位置上的开奖号码一致，即为中奖。",
            "7": "所选投注类型与开奖号码相对应，即为中奖，如第一名购买号码为大，开奖号码为大（6,7,8,9,10）即为中奖。",
            "8": "所选投注类型开奖号码相对应，即为中奖，如第二名购买号码为大，开奖号码为大（6,7,8,9,10）即为中奖。",
            "9": "所选投注类型开奖号码相对应，即为中奖，如第二名购买号码为大，开奖号码为大（6,7,8,9,10）即为中奖。",
            "10": "所选投注类型与开奖号码相对应，即为中奖，如第一名购买号码为单，开奖号码为单（1,3,5,7,9）即为中奖。",
            "11": "所选投注类型与开奖号码相对应，即为中奖，如第一名购买号码为单，开奖号码为单（1,3,5,7,9）即为中奖。",
            "12": "所选投注类型与开奖号码相对应，即为中奖，如第三位购买号码为单，开奖号码为单（1,3,5,7,9）即为中奖。",
          },
          //排列三
          "101": {
            "1111": "从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。",
            "1112": "所选数值等于开奖号码的百位、十位、个位三个数字相加之和，即为中奖。",
            "1113": "从0-9中选择2个数字组成两注，所选号码与开奖号码的百、十、个位相同且有1个号码重复，顺序不限，即为中奖。",
            "1114": "从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百、十、个位相同，顺序不限，即为中奖。",
            "1212": "从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的前二位相同，且顺序一致，即为中奖。",
            "1215": "所选数值等于开奖号码的十位、个位二个数字相加之和，即为中奖。",
            "1214": "从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，（不含对子）顺序不限，即为中奖。",
            "1211": "从百位、十位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。",
            "1216": "所选数值等于开奖号码的百位、十位二个数字相加之和，即为中奖。",
            "1213": "从0-9中选2个号码组成一注，所选号码与开奖号码的百位、十位相同，顺序不限，即为中奖。",
            "1311": "从百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。",
            "1411": "从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的百位、十位、个位中包含所选号码，即为中奖。"
          },
          "31": {
            "1": "至少选择1个和值进行投注，所选和值与开奖的3个号码相加之和相同即中奖。",
            "3": "任意选择一个或多个豹子（111 222 333 444 555 666）进行投注，选号与开奖号码一致即中奖。",
            "2": "对所有的豹子（111 222 333 444 555 666）进行投注，当开奖号码为任意一个豹子时，即中奖。",
            "4": "从1-6中任意选3个或多个号码，所选号码与3个开奖号码相同（顺序不限）即中奖。",
            "5": "对所有三个相连的号码（仅限：123、234、345、456）进行投注，当开奖号码为任意1个三连号时，即中奖。",
            "6": "对所有的对子（11 22 33 44 55 66）进行投注，开奖号码中包含所选的对子（不含豹子）时，即中奖。",
            "7": "至少选择1对相同号码与1个不同号码进行投注，所选号码与开奖号码3个相同即中奖。",
            "8": "从1-6中任意2个或多个号码组成一注，所选号码与开奖号码任意2个相同即中奖。",
            "9": "选1个胆码，1~5个拖码，胆码加拖码不少于2个，选号与开奖号码任意2号相同即中奖。",
          }
        },
      };
    },
  }
</script>
<style scoped>
  .exampleDetail {
    width: 300px;
    position: absolute;
    z-index: 99;
    box-shadow: 0px 0px 5px #ddd;
    background: #fff;
    border: 1px solid #ddd;
    color: #777 !important;;
    display: none;
    font-size: 13px;
    line-height: 20px;
    margin: 10px 0 0;
    overflow: hidden;
    padding: 8px 10px;
    text-align: left;
  }

  .exampleDetail:after {
    position: absolute;
    content: "";
    display: block;
    width: 0px;
    height: 0px;
    border: 10px solid #D73021;
    border-right-color: transparent;
    border-bottom-color: transparent;
    border-left-color: transparent;
    bottom: -20px;
    right: 17px;
    box-sizing: content-box !important;
  }

  .example:hover .exampleDetail,
  .winning-notes:hover .exampleDetail {
    display: inline-block;
  }
</style>


