<template>
   <div class="right wanfaguize_right">

            <div class="wanfa_header">

                <img src="https://cpweb.kosunmobile.com/c9.kosungames.com/uploads/images/20161227/586222193e53d.png" class="imgLogo" > &nbsp;香港⑥合彩
            </div>

            <div class="wanfa_content">

                <p class="red">一、重要声明</p>

                <p class="red">二、开奖与购买方式</p>

                <p class="red">三、兑奖</p>

                <p class="red">四、六合彩玩法说明</p>

                <p class="red">五、六合彩玩法详细说明</p>

                <p><b> 一、重要声明</b></p>
                <p>1. 如果客户怀疑自己的资料被盗用，应立即通知本站，并更改详细数据，以前的使用者名称及密码将全部无效。</p>
                <p>2. 客户有责任确保自己的账户及登入资料的保密性。以使用者名称及密码进行的任何网上投注将被视为有效。</p>
                <p>3. 公布赔率时出现的任何打字错误或非故意人为失误，本公司保留改正错误和按正确赔率结算投注的权力。</p>
                <p> 4. 每次登入时客户都应该核对自己的账户结余额。如对余额有任何疑问，请在第一时间内通知本站客服人员。</p>
                <p>  5. 一旦投注被接受，则不得取消或修改。</p>
                <p>  6. 所有号码赔率将不时浮动，派彩时的赔率将以确认投注时之赔率为准。</p>
                <p>  7. 所有投注都必须在开奖前时间内进行否则投注无效。</p>
                <p />
                <p><b> 二、开奖与购买方式</b></p>
                <p> 1.	六合彩是从1至49个号码中选出六个为中奖号码的奖券，由香港赛马会的附属公司「香港马会奖券有限公司」经办 。六合彩</p>
                <p> 每星期搅珠三次，通常于星期二、星期四及非赛马日之星期六或日晚上举行，并由电视台现场直播。</p>
                <p> 2.	六合彩注项单位每注金额最低1元。选择投注项时，购买者可预设金额，然后对其选定的投注号码进行投注。</p>
                <p> 3.	如果用户投注成功后，若因销售终端故障、通讯线路故障和投注站信用额度受限等原因造成当期无法开奖的，应退还购买者</p>
                <p> 投注金额。</p>
                <p />
                <p><b> 三、兑奖 </b></p>
                <p> 1. 六合彩官方开奖地址：<a href="http://bet.hkjc.com/marksix/default.aspx">官方网站</a></p>
                <p> 2.	无论大小奖均返还至用户在本站的账户中，一旦用户中奖，系统将自动返还中奖金额。可继续投注或提款，永无弃奖。</p>
                <p />
                <p><b> 四、六合彩玩法说明 </b></p>


                <p>
                    <img width="465" height="143" src="https://cpweb.kosunmobile.com/c9/Public/static/images/liuhecai_wanfa_1.png" alt="">
                </p>

                <p>
                    （一）特码 <br>
                    1.	特码 <br>
                    香港六合彩公司当期开出的最后一码为特码
                </p>

                <p>
                    <img width="465" height="80" src="https://cpweb.kosunmobile.com/c9/Public/static/images/liuhecai_wanfa_2.png" alt="">
                </p>

                <p>2.	特码大小</p>

                <p>
                    <img width="695" height="174" src="https://cpweb.kosunmobile.com/public/static/images/liuhecai_wanfa_3.png" alt="">
                </p>

                <p>3.	特码单双</p>

                <p>
                    <img width="695" height="174" src="https://cpweb.kosunmobile.com/public/static/images/liuhecai_wanfa_4.png" alt="">
                </p>

                <p>
                    4.	特码合数单双
                </p>

                <p>
                    <img width="695" height="174" src="https://cpweb.kosunmobile.com/public/static/images/liuhecai_wanfa_5.png" alt="">
                </p>

                <p><b> 五、六合彩玩法详细说明 </b></p>
                <p><b> 以下所有投注皆含本金。 </b></p>

                <b>特别号码盘势规则说明</b><br />
                香港六合彩公司当期开出的最后一码为特别号或特码。<br />
                特码 单 码：假设投注号码为开奖号码之特别号，视为中奖，其余情形视为不中奖。<br />
                特码 大 小：开出之特码大于或等于25为特码大， 小于或等于24为特码小，开出49为和。<br />
                特码 单 双：特码为双数叫特双，如8、16；特码为单数叫特单，如21、35，开出49为和。<br />
                特码和数大小：以特码个位和十位数字总和来判断胜负，和数大于或等于7为大，小于或等于6为小，开出49号为和。<br />
                特码和数单双：以特码个位和十位数字总和来判断单双，如01，12，32为和单，02，11，33为和双，开出49号为和。<br />
                特码尾数大小：以特别号尾数若0尾~4尾为小、5尾~9尾为大；如01、32、44为特尾小；如05、18、19为特尾大，开出49号为和。<br />
                特码 半 特：以特别号大小与特别号单双游戏为一个投注组合；当期特别号开出符合投注组合，即视为中奖；若当期特码开出49号，则视为和局；其余情形视为不中奖。<br />
                <br />
                两面：指大、小；单、双。<br />
                <br />
                每期六合彩开奖球数共七粒(包括特码)。<br />
                <br />
                正码：香港六合彩公司当期开出之前6个号码叫正码。每一个号码为一投注组合，假如投注号码为开奖号码之 正码，视为中奖，其余情形视为不中奖。<br />
                <br />
                正码1-6盘势规则说明<br />
                香港六合彩公司当期开出之前6个号码叫正码。第一时间出来的叫正码1，依次为正码2、正码3…… 正码6(并不以号码大小排序)。<br />
                大 小： 以指定出现正码的位置与号码大于或等于25为大，小于或等于24为小，开出49为和。<br />
                单 双： 以指定出现正码的位置与号码为单数或双数下注，开出49为和。<br />
                和数大小： 以指定出现正码的位置与号码个位和十位数字总和来判断胜负，和数大于或等于7为大，小于或等于6为小，开出49号为和。<br />
                和数单双： 以指定出现正码的位置与号码个位和十位数字总和来判断单双，开出49号为和。<br />
                色 波： 以指定出现正码的位置的球色下注，开奖之球色与下注之颜色相同时，视为中奖，其余情形视为不中奖。<br />
                尾数大小：以指定出现正码的位置与号码尾数大小下注，若0尾~4尾为小、5尾~9尾为大。如01、32、44为正尾小；如05、18、19为正尾大，开出49号为和。<br />
                <br />
                正码特： 正码特是指 正1特、正2特、正3特、正4特、正5特、正6特：其下注的正码特号与现场摇珠开出之正码其开奖顺序及开奖号码相同，视为中奖，如现场摇珠第一个正码开奖为49号，下注第一个正码特为49则视为中奖，其它号码视为不中奖。<br />
                <br />
                总和单双： 所有七个开奖号码的分数总和是单数叫(总分单)，如分数总和是115、183；分数总和是双数叫(总分双)，如分数总和是108、162。假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖 。<br />
                <br />
                总和大小： 所有七个开奖号码的分数总和大于或等于175为总分大；分数总和小于或等于174为总分小。如开奖号码为02、08、17、28、39、46、25，分数总和是165，则总分小。假如投注组合符合 中奖结果，视为中奖，其余情形视为不中奖。<br />
                <br />
                连码：<br />
                <br />
                四全中：所投注的每四个号码为一组合，若四个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖。如06、07、08、09四个都是开奖号码之正码，视为中奖，如三个正码加上一个特别号码视为不中奖。<br />
                三中二：所投注的每三个号码为一组合，若其中2个是开奖号码中的正码，即为三中二，视为中奖；若3个都是开奖号码中的正码，即为三中二之中三，其余情形视为不中奖，如06、07、08为一组合，开奖号码中有06、07两个正码，没有08，即为三中二，按三中二赔付；如开奖号码中有06、07、08三个正码，即为三中二之中三，按中三赔付；如出现1个或没有，视为不中奖。<br />
                三全中：所投注的每三个号码为一组合，若三个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖。如06、07、08三个都是开奖号码之正码，视为中奖，如两个正码加上一个特别号码视为不中奖 。<br />
                二全中：所投注的每二个号码为一组合，二个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖（含一个正码加一个特别号码之情形）。<br />
                二中特：所投注的每二个号码为一组合，二个号码都是开奖号码之正码，叫二中特之中二；若其中一 个是正码，一个是特别号码，叫二中特之中特；其余情形视为不中奖 。<br />
                特串：所投注的每二个号码为一组合，其中一个是正码，一个是特别号码，视为中奖，其余情形视为不中奖（含二个号码都是正码之情形） 。<br />
                依照二全中·二中特·特串 此3种玩法规则,来进行‘生肖对碰’或‘尾数对碰’。<br />
                <br />
                例一：<br />
                选择‘二全中’,之后进行‘生肖对碰’选择猴(2，14，26，38)以及鸡 (1，13，25，37，49)<br />
                则会产生20组号码组合：<br />
                [2,1] [2,13] [2,25] [2,37] [2,49]<br />
                [14,1] [14,13] [14,25] [14,37] [14,49]<br />
                [26,1] [26,13] [26,25] [26,37] [26,49]<br />
                [38,1] [38,13] [38,25] [38,37] [38,49]<br />
                <br />
                例二：<br />
                选择‘二中特’,之后进行‘尾数对碰’选择0(10，20，30，40)以及5(5，15，25，35，45)<br />
                则会产生20组号码组合：<br />
                [10,5] [10,15] [10,25] [10,35] [10,45]<br />
                [20,5] [20,15] [20,25] [20,35] [20,45]<br />
                [30,5] [30,15] [30,25] [30,35] [30,45]<br />
                [40,5] [40,15] [40,25] [40,35] [40,45]<br />
                肖串尾数:选择一主肖，可扥0-9尾的球。<br />
                以三全中的肖串尾数为例：<br />
                选择【羊】当主肖(号码03,15,27,39)并且扥9尾数．因为9尾数中的39已在主肖中出现，将不重复组合。<br />
                故羊主肖扥9尾数共可组合出24种组合(二个尾数号码+一个主肖号码的组合)。<br />
                连码：每个号码都有独立的赔率，下注组合的总赔率，取该组合号码的最低赔率为总赔率。<br />
                正码过关： 游戏规则同正码1-6盘势，但须同时投注多项结果，串联成投注组合，只要单期所开出之开奖结果符合您所选定之串联结果，即视为中奖，若其中一项结果不中，则视为不中奖；若其中一项结果为和，其余结果都中奖的情形，也视为中奖；和的项目赔率以一计算。<br />
                <br />
                生肖色波：分为生肖与色波两种玩法<br />
                <br />
                生肖：<br />
                生肖顺序为 鼠 >牛 >虎 >兔 >龙 >蛇 >马 >羊 >猴 >鸡 >狗 >猪<br />
                当该期结束时间为鸡年，就以鸡为开始，依顺序将49个号码分为12个生肖(如下)，再以生肖下注。<br />
                鸡 01 , 13 , 25 , 37 , 49<br />
                狗 12 , 24 , 36 , 48<br />
                猪 11 , 23 , 35 , 47<br />
                鼠 10 , 22 , 34 , 46<br />
                牛 09 , 21 , 33 , 45<br />
                虎 08 , 20 , 32 , 44<br />
                兔 07 , 19 , 31 , 43<br />
                龙 06 , 18 , 30 , 42<br />
                蛇 05 , 17 , 29 , 41<br />
                马 04 , 16 , 28 , 40<br />
                羊 03 , 15 , 27 , 39<br />
                猴 02 , 14 , 26 , 38<br />
                若当期特别号，落在下注生肖范围内，视为中奖 。<br />
                色波：以特别号的球色下注，开奖的球色与下注的颜色相同，视为中奖，球色号码分布如下:<br />
                01 , 11 , 21 , 31 , 41<br />
                02 , 12 , 22 , 32 , 42<br />
                03 , 13 , 23 , 33 , 43<br />
                04 , 14 , 24 , 34 , 44<br />
                05 , 15 , 25 , 35 , 45<br />
                06 , 16 , 26 , 36 , 46<br />
                07 , 17 , 27 , 37 , 47<br />
                08 , 18 , 28 , 38 , 48<br />
                09 , 19 , 29 , 39 , 49<br />
                10 , 20 , 30 , 40<br />
                一肖：<br />
                将生肖依序排列，当该期结束时间为鸡年，就以鸡为开始，依顺序将49个号码分为12个生肖(如下)，再以生肖下注。<br />
                鸡 01 , 13 , 25 , 37, 49<br />
                狗 12 , 24 , 36 , 48<br />
                猪 11 , 23 , 35 , 47<br />
                鼠 10 , 22 , 34 , 46<br />
                牛 09 , 21 , 33 , 45<br />
                虎 08 , 20 , 32 , 44<br />
                兔 07 , 19 , 31 , 43<br />
                龙 06 , 18 , 30 , 42<br />
                蛇 05 , 17 , 29 , 41<br />
                马 04 , 16 , 28 , 40<br />
                羊 03 , 15 , 27 , 39<br />
                猴 02 , 14 , 26 , 38<br />
                只要当期号码(所有正码与最后开出的特码)，落在下注生肖范围内，则视为中奖。(请注意：49亦算输赢，不为和)。<br />
                <br />
                合肖： 选1~11生肖(排列如同生肖)为一组合，并选择开奖号码的特码是否在此组合内，若选择是"中"(可选择2~11个生肖)且开奖号码的特码亦在此组合内，即视为中奖；若选择否"不中"(可选择1~10个生肖),系统会将选择不中的组合改为中的组合；若当期特码开出49号，则所有组合皆视为和局。<br />
                <br />
                超快速模式： 在此模式下所投注的注单，若是赔率变动时，系统将不会有赔率已变动的讯息提示，而会以投注当时的最新赔率接受投注。 例：使用超快速模式投注特别号，输入金额时，赔率为41.5倍，金额输入的过程中赔率已更新为41倍，金额输入完毕，确认投注时，注单上所显示的赔率将会是以41倍接受投注，当下投注画面上亦会更新为最新赔率。<br />
                <br />
                半波： 以特码色波和特单，特双，特大，特小为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出49号，则视为和局；其余情形视为不中奖。<br />
                <br />
                半半波： 以特码色波和特码单双及特码大小等三种游戏为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出49号，则视为和局；其余情形视为不中奖。<br />
                <br />
                正肖：依据开出的所有正码为主。若当期6个正码，只要有1个落在下注生肖范围内，视为中奖。如超过1个正码落在下注生肖范围内 ，派彩将倍增！<br />
                如：下注＄100.-正肖鸡赔率1.88<br />
                6个正码开出01，派彩为＄88.-<br />
                6个正码开出01，13，派彩为＄176.-<br />
                6个正码开出01，13，25，派彩为＄264.-<br />
                6个正码开出01，13，25，37，派彩为＄352.-<br />
                6个正码开出01，13，25，37，49，派彩为＄440.-(请注意：49亦算输赢，不为和)<br />
                <br />
                七色波： 以开出的7个色波，那种颜色最多为中奖。 开出的6个正码各以1个色波计，特别号以1.5个色波计。而以下3种结果视为和局。<br />
                6个正码开出3蓝3绿，而特别码是1.5红<br />
                6个正码开出3蓝3红，而特别码是1.5绿<br />
                6个正码开出3绿3红，而特别码是1.5蓝<br />
                如果出现和局，所有投注红，绿，蓝七色波的金额将全数退回，会员也可投注和局。<br />
                <br />
                特码头数：指特别号所属头数的号码<br />
                "0"头 ：01，02，03，04，05，06，07，08，09<br />
                "1"头 ：10，11，12，13，14，15，16，17，18，19<br />
                "2"头 ：20，21，22，23，24，25，26，27，28，29<br />
                "3"头 ：30，31，32，33，34，35，36，37，38，39<br />
                "4"头 ：40，41，42，43，44，45，46，47，48，49<br />
                例如 ：开奖结果特别号码是21则 "2"头为中奖，其他头数都不中奖<br />
                <br />
                特码尾数：指特别号所属尾数的号码<br />
                "1"尾 ：01，11，21，31，41<br />
                "2"尾 ：02，12，22，32，42<br />
                "3"尾 ：03，13，23，33，43<br />
                "4"尾 ：04，14，24，34，44<br />
                "5"尾 ：05，15，25，35，45<br />
                "6"尾 ：06，16，26，36，46<br />
                "7"尾 ：07，17，27，37，47<br />
                "8"尾 ：08，18，28，38，48<br />
                "9"尾 ：09，19，29，39，49<br />
                "0"尾 ：10，20，30，40<br />
                例如 ：开奖结果特别号码是21则 "1"尾为中奖，其他尾数都不中奖<br />
                <br />
                正特尾数：只要当期号码(所有正码及开出来的特码)，含所属尾数的一个或多个号码，但派彩只派一次，即不论同尾数号码出现一个或多个号码都只派彩一次。<br />
                "1"尾：01.11.21.31.41<br />
                "2"尾：02.12.22.32.42<br />
                "3"尾：03.13.23.33.43<br />
                "4"尾：04.14.24.34.44<br />
                "5"尾：05.15.25.35.45<br />
                "6"尾：06.16.26.36.46<br />
                "7"尾：07.17.27.37.47<br />
                "8"尾：08.18.28.38.48<br />
                "9"尾：09.19.29.39.49<br />
                "0"尾：10.20.30.40<br />
                例如 ：开奖结果正码是11、31、42、44、35、32特别号码是 21 则"1"尾"2"尾"4"尾"5"尾都为中奖，其他尾数都不中奖。<br />
                <br />
                总肖： 当期号码(所有正码与最后开出的特码)开出的不同生肖总数，与所投注之预计开出之生肖总数和(不用指定特定生肖)，则视为中奖，其余情形视为不中奖。例如：如果’当期号码为19、24、12、34、40、39 特别号：49，总计六个生肖，若选总肖【6】则为中奖。(请注意：49号亦算输赢，不为和)<br />
                <br />
                总肖单双： 当期号码(所有正码与最后开出的特码)开出的不同生肖总数若为单数则为单；若为双数则为双。例如当期号码为19、24、12、34、40、39.特码：49，则总计六个生肖，若下双则中奖。<br />
                <br />
                连肖： 挑选2~6生肖(排列如同生肖)为一个组合，当期号码(所有正码与最后开出的特码)坐落于投注时所勾选之生肖组合所属号码内，所勾选之生肖皆至少有中一个号码，则视为中奖，其余情况视为不中奖(请注意49亦算输赢，不为和)例如：如果当期号码为19、24、12、34、40、39.特码：49，所勾选三个生肖(称为三肖连)，若所有生肖的所属号码内至少一个出现于当期号码，则视为中奖。<br />
                <br />
                连尾： 挑选2~6个尾数为一组合，当期号码（所有正码与最后出的特码）坐落于投注时所勾选之尾数组合所属号码内，则视为中奖，其余情形视为不中奖(请注意49亦算输赢，不为和)<br />
                举例1：下注2尾碰，勾选0,1，当期七个号码若0尾及1尾皆有开出，视为中奖<br />
                举例2：下注2尾碰，勾选0,1,2三种尾数，会出现三种组合（组合一：0,1）（组合二：0,2）（组合三：1,2），当期七个号码若开出其中一种组合所选的两个尾数，视为中奖。<br />
                <br />
                自选不中奖： 挑选5~12个号码为一个组合，当期号码(所有正码与最后开出的特码)皆没有坐落于投注时所挑选之号码组合内，则视为中奖，若是有任何一个当期号码开在所挑选的号码组合情形视为不中奖。<br />
                例如当期号码为19,24,17,34,40,39,特别号49，所挑选5个号码(称为五不中)，若所挑选的号码内皆没有坐落于当期号码，则为中奖。<br />
                <br />
                七码： 七个开奖号码中【单、双、大、小】各有多少个(号码大于或等于25为大,小于或等于24为小)；开出49号算【单、大】。<br />
                例如∶投注【单0 . 双7】，若该期开出的七个号码中一个单数号码都没出现，即视为中奖；若七个号码中有一个或多个单数出现则为不中奖。<br />
                投注【大7 . 小0】，若该期开出的七个号码皆大于或等于25，即视为中奖；若七个号码中有一个或多个号码小于或等于24，则为不中奖。<br />
                <br />
                五行：<br />
                当期开出特别号为所属五行中的号码。<br />
                金： 03，04，17，18，25，26，33，34，47，48<br />
                木： 07，08，15，16，29，30，37，38，45，46<br />
                水： 05，06，13，14，21，22，35，36，43，44<br />
                火： 01，02，09，10，23，24，31，32，39，40<br />
                土： 11，12，19，20，27，28，41，42，49<br />
                <br />
                中一： 每个号码都有自己的赔率，下注组合的总赔率，取该组合号码的最低赔率为总赔率。<br />
                五中一：挑选5个号码为一投注组合进行下注。当期开出的7个开奖号码只有1个号码在该下注组合中，即视为中奖；其余情形视为不中奖。<br />
                六中一：挑选6个号码为一投注组合进行下注。当期开出的7个开奖号码只有1个号码在该下注组合中，即视为中奖；其余情形视为不中奖。<br />
                七中一：挑选7个号码为一投注组合进行下注。当期开出的7个开奖号码只有1个号码在该下注组合中，即视为中奖；其余情形视为不中奖。<br />
                八中一：挑选8个号码为一投注组合进行下注。当期开出的7个开奖号码只有1个号码在该下注组合中，即视为中奖；其余情形视为不中奖。<br />
                九中一：挑选9个号码为一投注组合进行下注。当期开出的7个开奖号码只有1个号码在该下注组合中，即视为中奖；其余情形视为不中奖。<br />
                十中一：挑选10个号码为一投注组合进行下注。当期开出的7个开奖号码只有1个号码在该下注组合中，即视为中奖；其余情形视为不中奖。<br />
                <br />
                </p>

            </div>


        </div>
</template>
<style lang="less" scoped>
@import './common.less'; 
.red{
    color: red !important;
}
*{
    font-size: 12px;
}
table tbody tr td:nth-last-child(1){
   border-right: none;
}
b{
    font-weight: bold;
}
p{
    font-weight: normal !important;
}
</style>